# ============================================================================
# Homebrew Bundle File
# ============================================================================
# This file defines all packages, applications, and extensions to be installed
# Run: brew bundle install

# ----------------------------------------------------------------------------
# Development Tools
# ----------------------------------------------------------------------------
brew "act"              # Run GitHub Actions locally
brew "gh"               # GitHub CLI
brew "go"               # Go programming language
brew "neovim"           # Modern Vim fork
brew "railway"          # Railway CLI for deployments
brew "docker-compose"   # Container orchestration
brew "hadolint"         # Dockerfile linter
brew "cmake"            # Cross-platform build system
brew "mise"             # Polyglot runtime manager (asdf alternative)

# ----------------------------------------------------------------------------
# Modern CLI Replacements
# ----------------------------------------------------------------------------
brew "bat"              # Better cat with syntax highlighting
brew "eza"              # Better ls with colors and git integration
brew "fd"               # Better find
brew "ripgrep"          # Better grep (extremely fast)
brew "duf"              # Better df (disk usage)
brew "procs"            # Better ps (process viewer)
brew "btop"             # Better top (system monitor)
brew "gping"            # Ping with a graph

# ----------------------------------------------------------------------------
# CLI Utilities
# ----------------------------------------------------------------------------
brew "fzf"              # Fuzzy finder
brew "jq"               # JSON processor
brew "zoxide"           # Smart cd command
brew "tmux"             # Terminal multiplexer
brew "zsh"              # Shell
brew "thefuck"          # Auto-correct console commands
brew "tlrc"             # tldr pages client
brew "oh-my-posh"       # Prompt theme engine
brew "hyperfine"        # Command-line benchmarking
brew "scc"              # Code counter with complexity analysis

# ----------------------------------------------------------------------------
# Web & API Tools
# ----------------------------------------------------------------------------
brew "caddy"            # Web server with automatic HTTPS
brew "hurl"             # HTTP request runner
brew "ffmpeg"           # Media processing
brew "sqlite"           # Database engine

# ----------------------------------------------------------------------------
# Formatters & Linters
# ----------------------------------------------------------------------------
brew "biome"            # Fast formatter/linter for web projects

# ----------------------------------------------------------------------------
# System Libraries
# ----------------------------------------------------------------------------
brew "fontconfig"       # Font configuration library

# ============================================================================
# Applications (Casks)
# ============================================================================

# ----------------------------------------------------------------------------
# AI & Development Tools
# ----------------------------------------------------------------------------
cask "claude-code"                  # Claude CLI coding assistant
cask "conductor"                    # Claude code parallelisation
cask "chatgpt"                      # ChatGPT desktop app
cask "codex"                        # OpenAI Codex coding agent
cask "antigravity"                  # AI coding agent IDE
cask "cursor"                       # AI-powered code editor
cask "windsurf"                     # Agentic IDE with AI Flow paradigm
cask "visual-studio-code"           # Code editor
cask "github"                       # GitHub Desktop

# ----------------------------------------------------------------------------
# Terminals
# ----------------------------------------------------------------------------
cask "warp"                         # Rust-based terminal

# ----------------------------------------------------------------------------
# Browsers
# ----------------------------------------------------------------------------
cask "google-chrome"                # Google Chrome browser
cask "firefox"                      # Mozilla Firefox browser
cask "microsoft-edge"               # Microsoft Edge browser

# ----------------------------------------------------------------------------
# Developer Tools
# ----------------------------------------------------------------------------
cask "figma"                        # Design tool
cask "orbstack"                     # Docker Desktop replacement
cask "yaak"                         # REST/GraphQL/gRPC client

# ----------------------------------------------------------------------------
# Productivity
# ----------------------------------------------------------------------------
cask "raycast"                      # Spotlight replacement
cask "notion"                       # Notes and collaboration

# ----------------------------------------------------------------------------
# Communication
# ----------------------------------------------------------------------------
cask "slack"                        # Team chat
cask "discord"                      # Voice and text chat

# ----------------------------------------------------------------------------
# Media & Entertainment
# ----------------------------------------------------------------------------
cask "spotify"                      # Music streaming
cask "spotmenu"                     # Spotify/iTunes menu bar

# ----------------------------------------------------------------------------
# Utilities
# ----------------------------------------------------------------------------
cask "1password"                    # Password manager
cask "nordvpn"                      # VPN client
cask "background-music"             # Per-app audio control
cask "elgato-control-center"        # Control Elgato devices
cask "philips-hue-sync"             # Smart light control

# ----------------------------------------------------------------------------
# Fonts
# ----------------------------------------------------------------------------
cask "font-fira-code-nerd-font"     # Fira Code with icons
cask "font-jetbrains-mono-nerd-font" # JetBrains Mono with icons
cask "font-montserrat"              # Montserrat font family
cask "font-quattrocento"            # Quattrocento serif font
cask "font-quattrocento-sans"       # Quattrocento sans serif

# ============================================================================
# VS Code Extensions
# ============================================================================

# ----------------------------------------------------------------------------
# AI & Coding Assistants
# ----------------------------------------------------------------------------
vscode "anthropic.claude-code"              # Claude Code extension
vscode "agsoft.claude-history-viewer"       # Claude history viewer
vscode "github.copilot"                     # GitHub Copilot
vscode "github.copilot-chat"                # Copilot chat interface

# ----------------------------------------------------------------------------
# Language Support
# ----------------------------------------------------------------------------
vscode "angular.ng-template"                # Angular templates
vscode "idleberg.applescript"               # AppleScript support
vscode "idleberg.jxa"                       # JavaScript for Automation
vscode "prisma.prisma"                      # Prisma ORM
vscode "tamasfe.even-better-toml"           # TOML support
vscode "unifiedjs.vscode-mdx"               # MDX support
vscode "blueglassblock.better-json5"        # JSON5 support

# ----------------------------------------------------------------------------
# Formatters & Linters
# ----------------------------------------------------------------------------
vscode "biomejs.biome"                      # Biome formatter/linter
vscode "bradlc.vscode-tailwindcss"          # Tailwind CSS IntelliSense

# ----------------------------------------------------------------------------
# API & GraphQL
# ----------------------------------------------------------------------------
vscode "apollographql.vscode-apollo"        # GraphQL support
vscode "jacobpfeifer.pfeifer-hurl"          # Hurl file support

# ----------------------------------------------------------------------------
# DevOps & Containers
# ----------------------------------------------------------------------------
vscode "ms-azuretools.vscode-containers"    # Docker container tools
vscode "ms-vscode-remote.remote-containers" # Remote container development
vscode "matthewpi.caddyfile-support"        # Caddyfile syntax

# ----------------------------------------------------------------------------
# Utilities
# ----------------------------------------------------------------------------
vscode "dnut.rewrap-revived"                # Text rewrapping
vscode "shd101wyy.markdown-preview-enhanced" # Enhanced markdown preview
vscode "pflannery.vscode-versionlens"       # Package version info

# ----------------------------------------------------------------------------
# Themes
# ----------------------------------------------------------------------------
vscode "enkia.tokyo-night"                  # Tokyo Night theme
